<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"edf71b2c18b8612d76d3f86b9d3dd79d47aad106525eba4c9931557ea8bb2246","plan_job_ref":"Job Run Terraform plan in staging #1 at https://github.com/GSA-TTS/review-repro/actions/runs/12712992190","plan_out_hash":"6c269f6d917339bfc38bffa1a682f0a3daa577158ea615a83203bad525bcfd0c","plan_hash":"31378a33625c78bf6ba4657dec95d539282a89a078a842c9c1d3a2c6f21b7b2b","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudfoundry_app.app will be created
+   resource "cloudfoundry_app" "app" {
+       buildpacks                  = [
+           "ruby_buildpack",
        ]
+       created_at                  = (known after apply)
+       disk_quota                  = (known after apply)
+       environment                 = {
+           "RAILS_ENV"                = "staging"
+           "RAILS_LOG_TO_STDOUT"      = "true"
+           "RAILS_MASTER_KEY"         = (sensitive value)
+           "RAILS_SERVE_STATIC_FILES" = "true"
        }
+       health_check_type           = (known after apply)
+       id                          = (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
+       name                        = "review_repro-staging"
+       org_name                    = "sandbox-gsa"
+       path                        = "./dist/src.zip"
+       processes                   = [
+           {
+               command                     = "./bin/rake cf:on_first_instance db:migrate && exec env HTTP_PORT=$PORT ./bin/thrust ./bin/rails server"
+               disk_quota                  = (known after apply)
+               health_check_type           = (known after apply)
+               instances                   = 1
+               log_rate_limit_per_second   = (known after apply)
+               memory                      = "256M"
+               readiness_health_check_type = (known after apply)
+               type                        = "web"
            },
        ]
+       readiness_health_check_type = (known after apply)
+       routes                      = [
+           {
+               protocol = (known after apply)
+               route    = "review_repro-staging.app.cloud.gov"
            },
        ]
+       service_bindings            = [
+           {
+               service_instance = "review_repro-rds-staging"
            },
        ]
+       source_code_hash            = "SuZ9+vrWTwQA90BwKILID2L4X7nK8GZTJvaQ7kpb0aQ="
+       space_name                  = "ryan.ahearn"
+       stack                       = (known after apply)
+       strategy                    = "blue-green"
+       updated_at                  = (known after apply)
    }

  # module.database.cloudfoundry_service_instance.rds will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       created_at        = (known after apply)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "review_repro-rds-staging"
+       service_plan      = "5ed9f319-4c75-4851-9885-598a96b7febc"
+       space             = "ea8c2230-0fdf-4fa3-8206-f0d5ccf7910f"
+       tags              = [
+           "terraform-cloudgov-managed",
        ]
+       type              = "managed"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #1](https://github.com/GSA-TTS/review-repro/actions/runs/12712992190)